[
    {
        "id": "callerMax",
        "title": "CallerMax&trade;",
        "description": "Online caller training application to onboard and certify new callers as well as provide advanced techniques to veteran staff."
    },
    {
        "id": "annualFundReview",
        "title": "Annual Fund/Advancement Office Review",
        "description": "LEAD will partner with you and your team to learn your pain points and make recommendations on industry best practices."
    },
    {
        "id": "annualFundPlanning",
        "title": "Annual Fund Planning",
        "description": "LEAD will guide you in the creation of a comprehensive solicitation calendar that thoughtfully involves the appropriate Annual Fund channels to ensure your touch points complement instead of compete."
    },
    {
        "id": "virtualConsulting",
        "title": "Virtual Consulting",
        "description": "Do you wish you had an industry expert on staff?  LEAD professionals can be an extension of your team providing strategies and analysis through unlimited calls, emails, and other forms of communication."
    },
    {
        "id": "directMail",
        "title": "Direct Mail/eSolicitations",
        "description": "LEAD's experience with Direct Mail/eSolicitations guides clients on who and when to reach out to via these channels, provide suggestions on messaging, and deliver suggested ask amounts."
    },
    {
        "id": "dayOfGiving",
        "title": "Day of Giving/Crowdfunding",
        "description": "LEAD provides recommendations to organizations that follow industry best practices that capitalize on the success of Day of Giving and Crowdfunding campaigns across the country."
    },
    {
        "id": "dataEnrichment",
        "title": "Data Enrichment",
        "description": "An institution's greatest asset is their prospect data.  LEAD is committed to maintaining the accuracy of your data and providing enrichment elements designed to improve the effectiveness of your communications. "
    },
    {
        "id": "engagementStudy",
        "title": "Engagement Study & Assessment",
        "description": "Specifically designed for universities seeking to give alums a greater voice and a seat at the table to drive important initiatives.  Learn key prospect insights, intentions, and attitudes while reigniting their interest."
    },
    {
        "id": "highEnd",
        "title": "High-End Annual Fund",
        "description": "Too many organizations allow high-end Annual Fund/low-end Major Gift prospects to fall through the cracks.  LEAD specializes in a series of strategies that safeguards these extremely valuable prospects."
    },
    {
        "id": "interimAFStaffing",
        "title": "Interim Annual Fund Staffing",
        "description": "Vacant staff position?  LEAD's team members can step in and continue to advance your fundraising projects so the momentum of your Annual Fund doesn't stall."
    },
    {
        "id": "seniorClass",
        "title": "Senior Class Gift",
        "description": "LEAD will help you plan your marketing and solicitation approach to give your organization the best opportunity of securing your first gift from someone who is hopefully a lifelong donor."
    },
    {
        "id": "studentPhilanthropic",
        "title": "Student Philanthropic Awareness",
        "description": "Educating students today about the philanthropy that has come before them must start when they step foot on campus.  LEAD successfully guides schools on how to effectively disseminate this message."
    },
    {
        "id": "telemax",
        "title": "TeleMax&trade;",
        "description": "LEAD's suite of services provide expert guidance and recommendations that allow you to maximize your in-house managed phone program."
    }
]