[
    {
        "id": "cgafke",
        "name": "Clark Gafke",
        "title": "Chief Executive Officer",
        "email": "cgafke@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/cgafke.jpg"
        },
        "bio": "<p>Clark Gafke enables nonprofit institutions to attract and motivate donors to achieve the organization’s strategic goals.</p><p>He helps the organization’s senior leadership evaluate and design strategic fundraising plans in the context of contemporary giving trends. He also assists the organization’s development staff to implement the plan through the design and conduct of specific communication initiatives for Capital and Annual Fund programs.</p><p>Clark’s experience enables him to provide guidance on using appropriate channels to reach prospects and donors in ways they want to communicate – face-to-face, special events, calling programs, direct mail efforts, email campaigns, crowdfunding & giving days, online technologies, digital communications, text-to-give, text-to-pledge and a host of other mobile channels.</p><p>In his 30-years providing fundraising counsel, Clark has served 211 organizations in the US and Canada representing education, healthcare, arts, museums, zoos, aquariums, public broadcasting and membership organizations.  In the process, he’s trained and coached more than 11,000 communicators.</p><p>Beyond this direct service to organizations, he is a frequent speaker at fundraising conferences including NCDC, CASE, AFP, PCI and on many college campuses. He is Past President of the Las Vegas AFP Chapter, a former national delegate, and Past Chair of the chapter’s Education Committee and Every Member Campaign. Clark is also a CASE Currents contributor.</p><p>Currently, Clark is a member of both the Las Vegas AFP and St. Louis AFP Chapters. He also serves on the program committee for the New Orleans AFP Chapter.</p><p>Clark began his fundraising work as a student caller in the alumni annual fund program at the University of Missouri. After graduation, he worked at the National 4-H Council in Washington, DC. Clark has served as Vice President and Senior Consultant for a variety of consulting firms.</p><p>He created the first online caller training program for colleges and universities and served as Dean for 21 PHONE/MAIL 101 workshops.</p><p>He is an avid supporter and volunteer for 4-H. Both Clark and his wife were named to the University of Missouri Extension Leaders Honor Roll in May of 2017 for their long-term commitment and support. Clark currently serves as Secretary for the County Extension Council Foundation, resides near St. Louis, MO and enjoys fishing and traveling with his wife and their two daughters.</p>"
    },
    {
        "id": "ccrow",
        "name": "Clinton Crow",
        "title": "Chief Operating Officer",
        "email": "ccrow@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/ccrow.jpg"
        },
        "bio": "<p>Clinton Crow embodies LEAD’s “Client’s First” philosophy as he helps LEAD partners combine the art and the science of fundraising in ways that connect hearts and minds to an organization’s mission. Clients know him for his positive attitude, enthusiasm and laser-focus attention to their institution’s specific situation. Additionally, they learn from Clinton that giving is personal. He helps package their organization’s inspiration through various giving channels that drives prospects to become part of a greater whole.</p><p>As a first-year student at Alma College in 1992, a phonathon sign caught his attention. He applied, was hired, and named the school’s top student caller four years in a row. He also showed a talent for coaching and training as he held the positions of ​Mentor Caller, Student Assistant, and Student Supervisor.</p><p>Since Alma, Clinton has spent over two decades helping nonprofits maximize their fundraising potential. His specialties are the pillars of development operations – high-end renewable gifts, sustaining gifts, employee giving, philanthropic awareness campaigns, tribute and reunion campaigns, and communication channels designed for phone, direct mail, digital, and fulfillment outreach.</p><p>Clinton’s professional responsibilities have included the management of complex fundraising operations involving 40 active fundraising campaigns at any given time.  He also oversaw 125 calling stations that served healthcare, community organizations, PBS stations, and museums to name a few.</p><p>Additionally, Clinton has provided direct counsel and guidance to some 60 nonprofit organizations.  He is a member of AFP, and resides in Denver, CO with his partner and their dog, Duke. His passions are travel, music, and any time he can be with family and friends across the country.</p>"
    },
    {
        "id": "rgafke",
        "name": "Roger Gafke",
        "title": "Senior Consultant",
        "email": "rgafke@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/rgafke.jpg"
        },
        "bio": "<p>Roger Gafke provides training and program planning, development and evaluation services to LEAD clients.</p><p>Roger assists executive-level administration in creating partnerships with corporations, foundations, associations and individuals who share the organization’s priorities. He also specializes in staff training and organization communications by use of the Internet and related digital technologies. He has created audio, video, and Web-based training programs, commercial Web sites, Web and email solicitation projects, newsletters, articles and other print support pieces.</p><p>These approaches grow from some five decades of experience in Institutional Advancement as a faculty member of the Missouri School of Journalism. He has served the University as Vice Chancellor for Advancement, Associate Dean of Journalism, Department Chair, and Director of Program Development for the Donald W. Reynolds Journalism Institute.</p><p>In these roles, Roger supervised his first phone program as a Department Chair in 1980. As Associate Dean in the early 80s, he led the successful solicitation for the first two endowed professorships at the University. In the 90s, serving as Vice Chancellor for University Advancement, his team doubled the number of donors and dollars coming in annually to the University and successfully completed the University’s first comprehensive capital campaign. During his tenure at Mizzou, Roger has raised over $100,000,000, securing several seven-figure and two eight-figure gifts.</p><p>Before joining the faculty in 1968, he served as a radio news director, newspaper city editor, public information officer for the U.S. Air Force and as a political science instructor. At the University, he was Vice Chancellor for Development, University and Alumni Relations from 1984 to 1994 and Executive Director of the Accrediting Council on Education for Journalism and Mass Communications from 1983 to 1985.</p><p>Roger received Bachelor of Journalism and Masters of Arts degrees from the University of Missouri and holds professional accreditation from the Association of Fundraising Professionals and from Langevin Learning Services.</p><p>Roger resides in Columbia, MO and enjoys dog training and traveling with his wife of 55 years.</p>"
    },
    {
        "id": "thenry",
        "name": "Thad Henry",
        "title": "Senior Consultant",
        "email": "thenry@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/thenry.jpg"
        },
        "bio": "<p>Thad has more than 30 years of experience leading fundraising operations and providing consultative services to a broad array of non-profit organizations. Combining his leadership and development experience, Thad is known for designing creative fundraising campaigns that optimize organizational growth and expansion of missional services and impact. Thad has led campaigns ranging from $1 million to $125 million at universities, colleges, food banks, independent schools, museums, art schools, historical museums, hospitals, social service organizations, faith-based denominations and organizations, and a botanical garden.</p><p>Thad has received numerous individual and organizational awards from national and international associations throughout his years of professional service. Some of his recognitions include the 2000 Greater Kansas City Council on Philanthropy Fundraiser of the Year, WV AFP Fundraiser of the Year, two Council for the Advancement and Support of Education Circle of Excellence Awards and the AAFRP Outstanding Fundraiser of the Year Award in the US and Canada.</p><p>Thad is a certified John Maxwell Leadership Coach and Consultant and has extensive experience in leadership development and facilitating workshops in the area of organizational change. Thad’s specializes in leveraging campaigns that accentuate brand identify and competitive advantages while optimizing engaged volunteer leadership. He provides innovative and creative approaches to engaging those who have the ability to provide transformational gifts and assistance to an organization.</p><p>Thad has a master’s degree from West Virginia University in Higher Education Administration and has completed coursework from Fielding Graduate Institute in Leadership Development. In his spare time, Thad supports the Leukemia and Lymphoma Society (LLS) by riding 100-mile century bike rides through their Team-in-Training (TNT) program. He has ridden more than a dozen rides that range from 100-150 miles while volunteering to raise funds for LLS in honor of a number of people who have battled leukemia.</p><p>Thad has three grown children. He and his wife reside in Rhode Island. Both are active in supporting non-profits and volunteer for a variety of organizations.</p>"
    },
    {
        "id": "lgracey",
        "name": "Lila Gracey",
        "title": "Senior Consultant",
        "email": "lgracey@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/lgracey.jpg"
        },
        "bio": "<p>Lila’s fundraising accomplishments span many State and National organizations.  In addition to serving the Democratic National Committee as a major-donor fundraiser, she was the Director of Donor Resources working with our country’s largest individual donors for equality at the Gill Foundation.  Lila also worked with the Women’s Foundation of Colorado as the first Program Director.  She has established grant-application and grant-review procedures, identified programs for funding and worked to establish more equal partnerships between foundations and nonprofit organizations.</p><p>Lila’s US Foreign service includes serving Ambassador Swanee Hunt in Austria and in the United States for several years heading her political and business activities. In addition she managed a professionally diverse staff and guided grant-making initiatives for The Hunt Alternatives Fund in mental health, housing and homelessness, the expansion of reproductive options for women, and poverty programs.</p><p>Lila’s professional experience also includes directing grassroots advocacy efforts, managing high-level social policy initiatives, and developing programs and direct services.  Lila has a broad background in politics that includes serving as scheduler for Governor Richard Lamm of Colorado.  She served for six years in the Mennonite Voluntary Service. She helped create and operate programs for people experiencing homelessness as well as founding and directing a national advocacy organization aimed at reform of the criminal justice system.  In addition, she worked with people experiencing major mental illnesses at a community mental health center.</p><p>Lila’s leadership skills developed through a variety of challenging positions: in the public and nonprofit sectors, as a donor, an entrepreneur, a management executive, a volunteer, a team member, and as a consultant. She has an unyielding commitment to help build strong communities through partnerships among government, nonprofits, philanthropists, and corporate entities. She is formally educated in Psychology.  Lila resides in Denver, CO and enjoys walking, reading and spending time with friends.</p>"
    },
    {
        "id": "pmoes",
        "name": "Peter Moes",
        "title": "Information Officer",
        "email": "pmoes@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/pmoes.jpg"
        },
        "bio": "<p>Peter Moes brings over 10 years of Annual Giving experience to his role with LEAD. He has worked as both a higher education Annual Giving professional and an Annual Giving consultant. Peter’s experiences implementing best practices by maximizing resources and using data to inform decisions has helped build strong Annual Giving programs across the country.</p><p>Peter’s experience includes serving as the Director of Annual Giving for the University of Utah. Within his role he oversees Utah’s Leadership Annual Giving Society as well as all aspects of the central Development Office’s Annual Giving efforts, including assessing results and advising campus areas on their specific Annual Giving strategy. Peter has also served as the Interim Director of Donor Relations and Communications at the University of Utah.</p><p>Prior to joining the University of Utah, Peter served as a fundraising Program Consultant for Harris Connect. Working with clients across the country, his efforts focused on Annual Giving programs with an emphasis on phonathon strategy, management and caller training.</p><p>He received a Bachelor’s Degree in Architecture from the University of Michigan and a Master’s Degree in Higher Education Administration from the University of South Carolina. Peter began his career in Student Affairs where he became involved in student philanthropy, which ultimately shaped his future career path.</p><p>Peter resides in Salt Lake City, UT with his wife, daughter and two dogs. He enjoys competing in triathlons in the summer and skiing in the winter.</p>"
    },
    {
        "id": "sbrink",
        "name": "Sharla Brink",
        "title": "Graphic Designer",
        "email": "sbrink@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/sbrink.jpg"
        },
        "bio": "<p>Sharla brings to LEAD a wide range of marketing and communications skills from previous experiences at Ruby Tuesday, Inc., LongHorn Steakhouse, Chick-fil-A, Keystone Foods and Catalina Marketing to name a few. In addition, she volunteers her time and expertise to several organizations close to her heart including Unlocking Autism and The Alzheimer’s Foundation.</p><p>As an adjunct instructor in the Department of Communications at the University of South Alabama in Mobile, Sharla enjoys a rewarding career in higher education. In addition to her experience in graphic design and visual identity for Spring Hill College and University of Tennessee at Martin, she offers freelance and pro bono services to agencies, K-12 schools, and various autism nonprofits.</p><p>On the fundraising side, Sharla’s efforts at Spring Hill College resulted in a 67% increase in donations for the Annual Fund and her redesign of the magazine increased donations by 45%.</p><p>Sharla’s formal education began with a Bachelor of Arts in Communication from Spring Hill College. She then attended the Portfolio Center in Atlanta, GA, receiving post-graduate education in Graphic Design. Sharla resides in Mobile, AL and enjoys spending time with family and friends, enjoying good food, making great memories, and escaping to the beach as often as possible.</p>"
    },
    {
        "id": "chughes",
        "name": "Christopher Hughes",
        "title": "Technology Officer",
        "email": "chughes@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/chughes.jpg"
        },
        "bio": "<p>Chris brings to LEAD 19 years of IT experience. As a Web developer working in modern CMS platforms, Chris’ specialties include Django, HTML5, CSS, Vue.js, Python and MySQL.</p><p>Chris moved into education as the Webmaster for Spring Hill College. Since 1999, Chris’ experiences include Web Developer, Director of Web Services, Director of Client Services, and Director of Enterprise Systems.</p><p>Chris is an ardent supporter of Spring Hill College&#39;s International Service and Immersion Program, a unique program where students travel to Central America to participate in cultural immersion and service projects in impoverished countries. Chris has served on five trips to Belize and Nicaragua and is looking forward to his next trip.</p><p>Chris resides in Mobile, AL with his son. He is an avid reader and enjoys spending time in the Gulf of Mexico.</p>"
    },
    {
        "id": "theath",
        "name": "Tanya Heath",
        "title": "Marketing Officer",
        "email": "theath@leadphilanthropy.com",
        "img": {
            "href": "/assets/img/people/theath.jpg"
        },
        "bio": "<p>Tanya is a graduate from the Missouri School of Journalism - Advertising. Her 26-year career includes serving as Adjunct Professor for the Missouri School of Journalism, Marketing Specialist at the MU Extension and the Director of Advertising in University Publications. She has also served as a fundraising consultant with SUNY Albany. Following her work with two Texas advertising agencies, Tanya was president of the American Advertising Federation of Mid-Missouri and served as Chair of the Education, Diversity and Public Service committees throughout the Federation’s 17-year existence. Tanya won Ad PRO of the Year and ADDY awards for her work in advertising. She helped the Mid-Missouri AAF chapter win second place in the public service category in the organization’s national competition.</p><p>Tanya stays involved in her community and continues to work in direct sales. Tanya resides in Columbia, MO and likes to travel with her husband and daughter.</p>"
    }
]